In [1]:
import pandas as pd

data = {
    'ID': [101, 102, 103, 104, 105, 106],
    'Name': ['Amit', 'Riya', 'Sohan', 'Amit', 'Riya', 'Rohan'],
    'Maths': [90, 85, None, 90, 85, 78],
    'Science': [88, None, 75, 88, 85, 78],
    'Grade': ['A', 'B', 'A', 'A', 'B', 'C']
}

df = pd.DataFrame(data)
print(df)

    ID   Name  Maths  Science Grade
0  101   Amit   90.0     88.0     A
1  102   Riya   85.0      NaN     B
2  103  Sohan    NaN     75.0     A
3  104   Amit   90.0     88.0     A
4  105   Riya   85.0     85.0     B
5  106  Rohan   78.0     78.0     C

In [2]:
df.iloc[0]

ID          101
Name       Amit
Maths      90.0
Science    88.0
Grade         A
Name: 0, dtype: object

In [3]:
df.iloc[0:3]

    ID   Name  Maths  Science Grade
0  101   Amit   90.0     88.0     A
1  102   Riya   85.0      NaN     B
2  103  Sohan    NaN     75.0     A

In [4]:
df.iloc[0:3,1]

0     Amit
1     Riya
2    Sohan
Name: Name, dtype: object

In [6]:
df.iloc[:,0:3]

    ID   Name  Maths
0  101   Amit   90.0
1  102   Riya   85.0
2  103  Sohan    NaN
3  104   Amit   90.0
4  105   Riya   85.0
5  106  Rohan   78.0

In [9]:
df.iloc[0:3,1:9]

    Name  Maths  Science Grade
0   Amit   90.0     88.0     A
1   Riya   85.0      NaN     B
2  Sohan    NaN     75.0     A

In [10]:
df.loc[0]

ID          101
Name       Amit
Maths      90.0
Science    88.0
Grade         A
Name: 0, dtype: object

In [11]:
df.loc[:,"Name"]

0     Amit
1     Riya
2    Sohan
3     Amit
4     Riya
5    Rohan
Name: Name, dtype: object

In [12]:
df.loc[0:2,'Name':'Maths']

    Name  Maths
0   Amit   90.0
1   Riya   85.0
2  Sohan    NaN

In [13]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [14]:
df.drop_duplicates(inplace=True)

In [15]:
df

    ID   Name  Maths  Science Grade
0  101   Amit   90.0     88.0     A
1  102   Riya   85.0      NaN     B
2  103  Sohan    NaN     75.0     A
3  104   Amit   90.0     88.0     A
4  105   Riya   85.0     85.0     B
5  106  Rohan   78.0     78.0     C

In [17]:
df.dropna(inplace=True)

In [18]:
df

    ID   Name  Maths  Science Grade
0  101   Amit   90.0     88.0     A
3  104   Amit   90.0     88.0     A
4  105   Riya   85.0     85.0     B
5  106  Rohan   78.0     78.0     C

In [19]:
df['Name'].value_counts()

Name
Amit     2
Riya     1
Rohan    1
Name: count, dtype: int64

In [21]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 4 entries, 0 to 5
Data columns (total 5 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   ID       4 non-null      int64
 1   Name     4 non-null      object
 2   Maths    4 non-null      float64
 3   Science  4 non-null      float64
 4   Grade    4 non-null      object
dtypes: float64(2), int64(1), object(2)
memory usage: 192.0+ bytes

In [22]:
df.groupby('Name').agg({'Maths':max})

C:\Users\RAUSHAN KUMAR\AppData\Local\Temp\ipykernel_5580\2611550486.py:1: FutureWarning: The provided callable <built-in function max> is currently using SeriesGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df.groupby('Name').agg({'Maths':max})

       Maths
Name
Amit    90.0
Riya    85.0
Rohan   78.0

In [23]:
df.to_csv("RAushan.csv",index=False)

In [24]:
rau = pd.read_csv("RAushan.csv")

In [26]:
rau

    ID   Name  Maths  Science Grade
0  101   Amit   90.0     88.0     A
1  104   Amit   90.0     88.0     A
2  105   Riya   85.0     85.0     B
3  106  Rohan   78.0     78.0     C

In [27]:
df.drop('Maths',axis=1,inplace=True)

In [28]:
df

    ID   Name  Science Grade
0  101   Amit     88.0     A
3  104   Amit     88.0     A
4  105   Riya     85.0     B
5  106  Rohan     78.0     C